frank0165/McuDspGit20250505/mcu_project__debug_fordsp/src/mcu/GDE501_fireware/Firmware/GD32E501_standard_peripheral/Source/gd32e501_fmc.c
    /* return the fmc state  */
    return fmc_state;
}

/*!
    \brief      program a double word at the corresponding address in main flash
    \param[in]  address: address to program
    \param[in]  data: double word to program
    \param[out] none
    \retval     fmc_state: state of FMC
      \arg        FMC_READY: the operation has been completed
      \arg        FMC_BUSY: the operation is in progress
      \arg        FMC_PGERR: program error
      \arg        FMC_PGAERR: program alignment error
      \arg        FMC_WPERR: erase/program protection error
      \arg        FMC_TOERR: timeout error
      \arg        FMC_ILLEGAL_OPERATION: user illegal operation 
*/
fmc_state_enum fmc_doubleword_program(uint32_t address, uint64_t data)
{ 
    uint32_t data0, data1;  
    fmc_state_enum fmc_state;
    
    /* check whether program address is illegal */
    if(((address > FLASH_BASE_ADDRESS) && (address < FLASH_END_ADDRESS)) ||
    ((address > 0U) && (address < (FLASH_END_ADDRESS - FLASH_BASE_ADDRESS)))){ /*这应该是逻辑地址，但是后续对bank的判断又不对*/
    }else{
        return FMC_ILLEGAL_OPERATION;
    }

    if(address < BANK_ADDRESS_BOUNDARY){
        if((OB_USER_VALUE & OB_FB_MODE_OFF) == OB_FB_MODE_OFF){
            fmc_state = fmc_bank0_ready_wait(FMC_TIMEOUT_COUNT);
            data0 = (uint32_t)(data & 0xFFFFFFFFU);
            data1 = (uint32_t)((data>>32U) & 0xFFFFFFFFU);

            /* configure program width */
            if(FMC_READY == fmc_state){ 
                /* set the PG bit to start program */
                FMC_CTL0 |= FMC_CTL0_PG; 
                REG32(address) = data0;
                REG32(address+4U) = data1;
                /* wait for the FMC ready */
                fmc_state = fmc_bank0_ready_wait(FMC_TIMEOUT_COUNT);

                /* reset the PG bit */
                FMC_CTL0 &= ~FMC_CTL0_PG; 
            }
        }else{
            fmc_state = fmc_bank1_ready_wait(FMC_TIMEOUT_COUNT);
            data0 = (uint32_t)(data & 0xFFFFFFFFU);
            data1 = (uint32_t)((data>>32U) & 0xFFFFFFFFU);

            /* configure program width */
            if(FMC_READY == fmc_state){ 
                /* set the PG bit to start program */
                FMC_CTL1 |= FMC_CTL1_PG; 
                REG32(address) = data0;
                REG32(address+4U) = data1;
                /* wait for the FMC ready */
                fmc_state = fmc_bank1_ready_wait(FMC_TIMEOUT_COUNT);

                /* reset the PG bit */
                FMC_CTL1 &= ~FMC_CTL1_PG; 
            }
        }
    }else{

        if((OB_USER_VALUE & OB_FB_MODE_OFF) == OB_FB_MODE_OFF){
            fmc_state = fmc_bank1_ready_wait(FMC_TIMEOUT_COUNT);
            data0 = (uint32_t)(data & 0xFFFFFFFFU);
            data1 = (uint32_t)((data>>32U) & 0xFFFFFFFFU);

            /* configure program width */
            if(FMC_READY == fmc_state){
                /* set the PG bit to start program */
                FMC_CTL1 |= FMC_CTL1_PG;
                REG32(address) = data0;
                REG32(address+4U) = data1;
                /* wait for the FMC ready */
                fmc_state = fmc_bank1_ready_wait(FMC_TIMEOUT_COUNT);

                /* reset the PG bit */
                FMC_CTL1 &= ~FMC_CTL1_PG;
            }
        }else{
            fmc_state = fmc_bank0_ready_wait(FMC_TIMEOUT_COUNT);
            data0 = (uint32_t)(data & 0xFFFFFFFFU);
            data1 = (uint32_t)((data>>32U) & 0xFFFFFFFFU);

            /* configure program width */
            if(FMC_READY == fmc_state){
                /* set the PG bit to start program */
                FMC_CTL0 |= FMC_CTL0_PG;
                REG32(address) = data0;
                REG32(address+4U) = data1;
                /* wait for the FMC ready */
                fmc_state = fmc_bank0_ready_wait(FMC_TIMEOUT_COUNT);

                /* reset the PG bit */
                FMC_CTL0 &= ~FMC_CTL0_PG;
            }
        }
    }
    /* return the FMC state */
    return fmc_state;
}

/*!
    \brief      program a double word at the corresponding address in OTP 
    \param[in]  address: address to program
    \param[in]  data: double word to program
    \param[out] none
    \retval     fmc_state: state of FMC
      \arg        FMC_READY: the operation has been completed
      \arg        FMC_BUSY: the operation is in progress
      \arg        FMC_PGERR: program error
      \arg        FMC_PGAERR: program alignment error
      \arg        FMC_WPERR: erase/program protection error
      \arg        FMC_TOERR: timeout error
      \arg        FMC_ILLEGAL_OPERATION: user illegal operation 
*/
fmc_state_enum otp_doubleword_program(uint32_t address, uint64_t data)
{ 
    uint32_t data0, data1;  
    fmc_state_enum fmc_state;
    
    /* check whether program address is illegal */
    if((address < OTP_BASE_ADDRESS) || (address > OTP_END_ADDRESS)){
        return FMC_ILLEGAL_OPERATION;
    }

    fmc_state = fmc_bank1_ready_wait(FMC_TIMEOUT_COUNT);
    data0 = (uint32_t)(data & 0xFFFFFFFFU);
    data1 = (uint32_t)((data>>32U) & 0xFFFFFFFFU);

    /* configure program width */
    if(FMC_READY == fmc_state){ 
        /* set the PG bit to start program */
        FMC_CTL1 |= FMC_CTL1_PG; 
        REG32(address) = data0;
        REG32(address+4U) = data1;
        /* wait for the FMC ready */
        fmc_state = fmc_bank1_ready_wait(FMC_TIMEOUT_COUNT);

        /* reset the PG bit */
        FMC_CTL1 &= ~FMC_CTL1_PG; 
    }
    /* return the FMC state */
    return fmc_state;
}

/*!
    \brief      unlock the option byte operation
                it is better to used in pairs with ob_lock
    \param[in]  none
    \param[out] none
    \retval     none
*/
void ob_unlock(void)
{
    if(RESET == (FMC_CTL0 & FMC_CTL0_OBWEN)){
        /* write the FMC key */
        FMC_OBKEY = UNLOCK_KEY0;
        FMC_OBKEY = UNLOCK_KEY1;
    }
    /* wait until OBWEN bit is set by hardware */
    while(RESET == (FMC_CTL0 & FMC_CTL0_OBWEN)){
    }
}

/*!
    \brief      lock the option byte operation
                it is better to used in pairs with ob_unlock after an operation
    \param[in]  none
    \param[out] none
    \retval     none
*/
void ob_lock(void)
{
    /* reset the OBWE bit */
    FMC_CTL0 &= ~FMC_CTL0_OBWEN;
}

/*!
    \brief      reload the option byte and generate a system reset
    \param[in]  none
    \param[out] none
    \retval     none
*/
void ob_reset(void)
{
    /* set the OBRLD bit */
    FMC_CTL0 |= FMC_CTL0_OBRLD;
}

/*!
    \brief      erase the option byte
                programmer must ensure FMC & option byte are both unlocked before calling this function
    \param[in]  none
    \param[out] none
    \retval     fmc state
      \arg        FMC_READY: the operation has been completed
      \arg        FMC_BUSY: the operation is in progress
      \arg        FMC_PGERR: program error
      \arg        FMC_PGAERR: program alignment error
      \arg        FMC_WPERR: erase/program protection error
      \arg        FMC_TOERR: timeout error
      \arg        FMC_ILLEGAL_OPERATION: user illegal operation
*/
fmc_state_enum ob_erase(void)
{
    option_byte_struct ob_struct;

    fmc_state_enum fmc_state = fmc_bank0_ready_wait(FMC_TIMEOUT_COUNT);

