frank0165/McuDspGit20250505/mcu_project__debug_fordsp/src/mcu/GDE501_fireware/Firmware/GD32E501_standard_peripheral/Source/gd32e501_fmc.c
    ob_struct.ob_spc = OB_SPC;
    ob_struct.ob_user = 0xFFFFU;
    ob_struct.ob_data = 0xFFFFFFFFU;
    ob_struct.ob_wp = 0xFFFFFFFFFFFFFFFFU;

    if(FMC_READY == fmc_state){
        /* start erase the option byte */
        FMC_CTL0 |= FMC_CTL0_OBER;
        FMC_CTL0 |= FMC_CTL0_START;

        /* wait for the FMC ready */
        fmc_state = fmc_bank0_ready_wait(FMC_TIMEOUT_COUNT);

        if(FMC_READY == fmc_state){
            /* reset the OBER bit */
            FMC_CTL0 &= ~FMC_CTL0_OBER;

            /* set the OBPG bit */
            FMC_CTL0 |= FMC_CTL0_OBPG;
            
            /* restore the last get option byte security protection code */
            ob_write(&ob_struct, DOUBLEWORD_SPC_USER_DATA);
            ob_write(&ob_struct, DOUBLEWORD_WP);

            /* wait for the FMC ready */
            fmc_state = fmc_bank0_ready_wait(FMC_TIMEOUT_COUNT);

            if(FMC_TOERR != fmc_state){
                /* reset the OBPG bit */
                FMC_CTL0 &= ~FMC_CTL0_OBPG;
            }
        }else{
            /* reset the OBER bit */
            FMC_CTL0 &= ~FMC_CTL0_OBER;

            if(FMC_TOERR != fmc_state){
                /* reset the OBPG bit */
                FMC_CTL0 &= ~FMC_CTL0_OBPG;
            }
        }
    }
    /* return the FMC state */
    return fmc_state;
}

/*!
    \brief      write option byte
    \param[in]  ob_struct: option byte structure 
                            and the member values are shown as below:
                  ob_spc: value of spc in option byte
                  ob_user: value of user in option byte
                  ob_data: value of data in option byte
                  ob_wp: value of wp in option byte
    \param[in]  ob_num: refer to rcu_periph_enum
      \arg        DOUBLEWORD_SPC_USER_DATA: first 64 bits of option byte, include SPC, USER, DATA
      \arg        DOUBLEWORD_WP: second 64 bits of option byte, include WP
    \param[out] none
    \retval     none
*/
static void ob_write(option_byte_struct* ob_struct, option_byte_enum ob_num)
{
    /* write first 64 bits of option byte */
    if(DOUBLEWORD_SPC_USER_DATA == ob_num){
        uint32_t ob_val0;
        uint32_t ob_val1;

        ob_val0 = (uint32_t)(ob_struct->ob_spc);
        ob_val0 |= (((uint32_t)ob_struct->ob_user)<<16U);
        ob_val1 = ob_struct->ob_data;

        REG32(0x1ffff800U) = ob_val0;
        REG32(0x1ffff804U) = ob_val1;
    }else{
        /* write second 64 bits of option byte */
        REG32(0x1ffff808U) = (uint32_t)ob_struct->ob_wp;
        REG32(0x1ffff80cU) = (uint32_t)(ob_struct->ob_wp >> 32U);
    }
}

/*!
    \brief      enable option byte write protection (OB_WP)
    \param[in]  ob_wp: write protection configuration data. Notice that set the
                bit to 1 if you want to protect the corresponding pages.
    \param[out] none
    \retval     fmc_state: state of FMC
      \arg        FMC_READY: the operation has been completed
      \arg        FMC_BUSY: the operation is in progress
      \arg        FMC_PGERR: program error
      \arg        FMC_PGAERR: program alignment error
      \arg        FMC_WPERR: erase/program protection error
      \arg        FMC_TOERR: timeout error
      \arg        FMC_ILLEGAL_OPERATION: user illegal operation
*/
fmc_state_enum ob_write_protection_enable(uint32_t ob_wp)
{
    option_byte_struct ob_struct;
    uint64_t ob_wrp_val = 0x00000000U;

    /* check whether expected write protection address region is illegal */
    if(0U != ((ob_wp & 0x7FFFFFFF) >>(FMC_SIZE /0x10))){
         return FMC_ILLEGAL_OPERATION;
    }

    fmc_state_enum fmc_state = fmc_bank0_ready_wait(FMC_TIMEOUT_COUNT);

    ob_struct.ob_spc = OB_SPC;
    ob_struct.ob_user = OB_USER;
    ob_struct.ob_data = OB_DATA;
    ob_struct.ob_wp = OB_WP;

    ob_wp = (uint32_t)(~ob_wp);

    ob_wrp_val |= (uint64_t)ob_wp & 0x000000FFU;
    ob_wrp_val |= ((uint64_t)ob_wp & 0x0000FF00U)<< 8U ;
    ob_wrp_val |= ((uint64_t)ob_wp & 0x00FF0000U)<< 16U;
    ob_wrp_val |= ((uint64_t)ob_wp & 0xFF000000U)<< 24U;

    ob_struct.ob_wp = ob_struct.ob_wp & ob_wrp_val;

    if(FMC_READY == fmc_state){
        /* start erase the option byte */
        FMC_CTL0 |= FMC_CTL0_OBER;
        FMC_CTL0 |= FMC_CTL0_START;

        /* wait for the FMC ready */
        fmc_state = fmc_bank0_ready_wait(FMC_TIMEOUT_COUNT);

        if(FMC_READY == fmc_state){
        
            /* reset the OBER bit */
            FMC_CTL0 &= ~FMC_CTL0_OBER;

            /* enable the option bytes programming */
            FMC_CTL0 |= FMC_CTL0_OBPG;
            
            ob_write(&ob_struct, DOUBLEWORD_WP);
            ob_write(&ob_struct, DOUBLEWORD_SPC_USER_DATA);
            /* wait for the FMC ready */
            fmc_state = fmc_bank0_ready_wait(FMC_TIMEOUT_COUNT);

            if(FMC_TOERR != fmc_state){
                /* reset the OBPG bit */
                FMC_CTL0 &= ~FMC_CTL0_OBPG;
            }
        }else{
            if(FMC_TOERR != fmc_state){
                /* reset the OBER bit */
                FMC_CTL0 &= ~FMC_CTL0_OBER;
            }
        }
    }
    /* return the FMC state */
    return fmc_state;
}

/*!
    \brief      configure security protection
    \param[in]  ob_spc: specify security protection code
      \arg        FMC_NSPC: no security protection
      \arg        FMC_LSPC: low security protection
      \arg        FMC_HSPC: high security protection
    \param[out] none
    \retval     fmc_state: state of FMC
      \arg        FMC_READY: the operation has been completed
      \arg        FMC_BUSY: the operation is in progress
      \arg        FMC_PGERR: program error
      \arg        FMC_PGAERR: program alignment error
      \arg        FMC_WPERR: erase/program protection error
      \arg        FMC_TOERR: timeout error
      \arg        FMC_ILLEGAL_OPERATION: user illegal operation 
*/
fmc_state_enum ob_security_protection_config(uint16_t ob_spc)
{
    option_byte_struct ob_struct;
    fmc_state_enum fmc_state = fmc_bank0_ready_wait(FMC_TIMEOUT_COUNT);

    ob_struct.ob_spc = ob_spc;
    ob_struct.ob_user = OB_USER;
    ob_struct.ob_data = OB_DATA;
    ob_struct.ob_wp = OB_WP;

    if(FMC_READY == fmc_state){
        /* start erase the option byte */
        FMC_CTL0 |= FMC_CTL0_OBER;
        FMC_CTL0 |= FMC_CTL0_START;

        /* wait for the FMC ready */
        fmc_state = fmc_bank0_ready_wait(FMC_TIMEOUT_COUNT);

        if(FMC_READY == fmc_state){

            /* reset the OBER bit */
            FMC_CTL0 &= ~FMC_CTL0_OBER;

