frank0165/McuDspGit20250505/mcu_project__debug_fordsp/src/mcu/GDE501_fireware/Firmware/GD32E501_standard_peripheral/Source/gd32e501_fmc.c
    if(FMC_STAT1 & flag){
        status = SET;
    }
    /* return the state of corresponding FMC flag */
    return status;
}

/*!
    \brief      clear the flash bank0 pending flag by writing 1
    \param[in]  flag: clear FMC flag
                one or more parameters can be selected which is shown as below:
      \arg        FMC_BANK0_FLAG_PGERR: FMC programming error flag
      \arg        FMC_BANK0_FLAG_PGAERR: FMC program alignment error flag
      \arg        FMC_BANK0_FLAG_WPERR: FMC write protection error flag
      \arg        FMC_BANK0_FLAG_END: FMC end of programming flag
    \param[out] none
    \retval     none
*/
void fmc_bank0_flag_clear(uint32_t flag)
{
    /* clear the flags */
    FMC_STAT0 |= flag;
}

/*!
    \brief      clear the flash bank1 pending flag by writing 1
    \param[in]  flag: clear FMC flag
                one or more parameters can be selected which is shown as below:
      \arg        FMC_BANK1_FLAG_PGERR: FMC programming error flag
      \arg        FMC_BANK1_FLAG_PGAERR: FMC program alignment error flag
      \arg        FMC_BANK1_FLAG_WPERR: FMC write protection error flag
      \arg        FMC_BANK1_FLAG_END: FMC end of programming flag
    \param[out] none
    \retval     none
*/
void fmc_bank1_flag_clear(uint32_t flag)
{
    /* clear the flags */
    FMC_STAT1 |= flag;
}

/*!
    \brief      enable flash bank0 interrupt
    \param[in]  interrupt: the FMC interrupt source
      \arg        FMC_BANK0_INTEN_END: FMC end of operation interrupt
      \arg        FMC_BANK0_INTEN_ERR: FMC error interrupt
    \param[out] none
    \retval     none
*/
void fmc_bank0_interrupt_enable(uint32_t interrupt)
{
    FMC_CTL0 |= interrupt;
}

/*!
    \brief      enable flash bank1 interrupt
    \param[in]  interrupt: the FMC interrupt source
      \arg        FMC_BANK1_INTEN_END: FMC end of operation interrupt
      \arg        FMC_BANK1_INTEN_ERR: FMC error interrupt
    \param[out] none
    \retval     none
*/
void fmc_bank1_interrupt_enable(uint32_t interrupt)
{
    FMC_CTL1 |= interrupt;
}

/*!
    \brief      disable flash bank0 interrupt
    \param[in]  interrupt: the FMC interrupt source
      \arg        FMC_BANK0_INTEN_END: FMC end of operation interrupt
      \arg        FMC_BANK0_INTEN_ERR: FMC error interrupt
    \param[out] none
    \retval     none
*/
void fmc_bank0_interrupt_disable(uint32_t interrupt)
{
    FMC_CTL0 &= ~(uint32_t)interrupt;
}

/*!
    \brief      disable flash bank1 interrupt
    \param[in]  interrupt: the FMC interrupt source
      \arg        FMC_BANK1_INTEN_END: FMC end of operation interrupt
      \arg        FMC_BANK1_INTEN_ERR: FMC error interrupt
    \param[out] none
    \retval     none
*/
void fmc_bank1_interrupt_disable(uint32_t interrupt)
{
    FMC_CTL1 &= ~(uint32_t)interrupt;
}

/*!
    \brief      get flash bank0 intrrupt flag set or reset
    \param[in]  flag: check FMC flag
                only one parameter can be selected which is shown as below:
      \arg        FMC_BANK0_INT_FLAG_PGERR: FMC programming error flag
      \arg        FMC_BANK0_INT_FLAG_PGAERR: FMC program alignment error flag
      \arg        FMC_BANK0_INT_FLAG_WPERR: FMC write protection error flag
      \arg        FMC_BANK0_INT_FLAG_END: FMC end of programming flag
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus fmc_bank0_interrupt_flag_get(uint32_t int_flag)
{
    uint32_t intenable = 0U, flagstatus = 0U;

    if(FMC_BANK0_INT_FLAG_END == int_flag){
        /* get the interrupt enable bit status */
        intenable = FMC_CTL0 & FMC_BANK0_INTEN_END;
        /* get the corresponding flag bit status */
        flagstatus = FMC_STAT0 & int_flag;
        if(intenable && flagstatus){
            return SET;
        }else{
            return RESET;
        }
    }else{
        /* get the interrupt enable bit status */
        intenable = FMC_CTL0 & FMC_BANK0_INTEN_ERR;
        /* get the corresponding flag bit status */
        flagstatus = FMC_STAT0 & int_flag;
        if(intenable && flagstatus){
            return SET;
        }else{
            return RESET;
        }
    }
}

/*!
    \brief      get flash bank1 intrrupt flag set or reset
    \param[in]  flag: check FMC flag
                only one parameter can be selected which is shown as below:
      \arg        FMC_BANK1_INT_FLAG_PGERR: FMC programming error flag
      \arg        FMC_BANK1_INT_FLAG_PGAERR: FMC program alignment error flag
      \arg        FMC_BANK1_INT_FLAG_WPERR: FMC write protection error flag
      \arg        FMC_BANK1_INT_FLAG_END: FMC end of programming flag
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus fmc_bank1_interrupt_flag_get(uint32_t int_flag)
{
    uint32_t intenable = 0U, flagstatus = 0U;

    if(FMC_BANK1_INT_FLAG_END == int_flag){
        /* get the interrupt enable bit status */
        intenable = FMC_CTL1 & FMC_BANK1_INTEN_END;
        /* get the corresponding flag bit status */
        flagstatus = FMC_STAT1 & int_flag;
        if(intenable && flagstatus){
            return SET;
        }else{
            return RESET;
        }
    }else{
        /* get the interrupt enable bit status */
        intenable = FMC_CTL1 & FMC_BANK1_INTEN_ERR;
        /* get the corresponding flag bit status */
        flagstatus = FMC_STAT1 & int_flag;
        if(intenable && flagstatus){
            return SET;
        }else{
            return RESET;
        }
    }
}

/*!
    \brief      clear the flash bank0 interrupt pending flag by writing 1
    \param[in]  flag: clear FMC flag
                one or more parameters can be selected which is shown as below:
      \arg        FMC_BANK0_INT_FLAG_PGERR: FMC programming error flag
      \arg        FMC_BANK0_INT_FLAG_PGAERR: FMC program alignment error flag
      \arg        FMC_BANK0_INT_FLAG_WPERR: FMC write protection error flag
      \arg        FMC_BANK0_INT_FLAG_END: FMC end of programming flag
    \param[out] none
    \retval     none
*/
void fmc_bank0_interrupt_flag_clear(uint32_t int_flag)
{
    /* clear the flags */
    FMC_STAT0 = int_flag;
}

/*!
    \brief      clear the flash bank1 interrupt pending flag by writing 1
    \param[in]  flag: clear FMC flag
                one or more parameters can be selected which is shown as below:
      \arg        FMC_BANK1_INT_FLAG_PGERR: FMC programming error flag
      \arg        FMC_BANK1_INT_FLAG_PGAERR: FMC program alignment error flag
      \arg        FMC_BANK1_INT_FLAG_WPERR: FMC write protection error flag
      \arg        FMC_BANK1_INT_FLAG_END: FMC end of programming flag
    \param[out] none
    \retval     none
*/
void fmc_bank1_interrupt_flag_clear(uint32_t int_flag)
{
    /* clear the flags */
    FMC_STAT1 = int_flag;
}

/*!
    \brief      get the flash bank0 state
    \param[in]  none
    \param[out] none
    \retval     fmc_state
*/
fmc_state_enum fmc_bank0_state_get(void)
{
    fmc_state_enum fmc_state = FMC_READY;

