frank0165/McuDspGit20250505/mcu_project__debug_fordsp/src/mcu/GDE501_fireware/Firmware/GD32E501_standard_peripheral/Source/gd32e501_fmc.c
    if((uint32_t)0x00U != (FMC_STAT0 & FMC_STAT0_BUSY)){
        fmc_state = FMC_BUSY;
    }else{
        if((uint32_t)0x00U != (FMC_STAT0 & FMC_STAT0_WPERR)){
            fmc_state = FMC_WPERR;
        }else{
            if((uint32_t)0x00U != (FMC_STAT0 & FMC_STAT0_PGERR)){
                fmc_state = FMC_PGERR; 
            }
        }
    }
    /* return the FMC state */
    return fmc_state;
}

/*!
    \brief      get the flash bank1 state
    \param[in]  none
    \param[out] none
    \retval     fmc_state
*/
fmc_state_enum fmc_bank1_state_get(void)
{
    fmc_state_enum fmc_state = FMC_READY;

    if((uint32_t)0x00U != (FMC_STAT1 & FMC_STAT1_BUSY)){
        fmc_state = FMC_BUSY;
    }else{
        if((uint32_t)0x00U != (FMC_STAT1 & FMC_STAT1_WPERR)){
            fmc_state = FMC_WPERR;
        }else{
            if((uint32_t)0x00U != (FMC_STAT1 & FMC_STAT1_PGERR)){
                fmc_state = FMC_PGERR; 
            }
        }
    }
    /* return the FMC state */
    return fmc_state;
}

/*!
    \brief      check whether flash bank0 is ready or not
    \param[in]  timeout: timeout count
    \param[out] none
    \retval     fmc_state
*/
fmc_state_enum fmc_bank0_ready_wait(uint32_t timeout)
{
    fmc_state_enum fmc_state = FMC_BUSY;

    /* wait for FMC ready */
    do{
        /* get FMC state */
        fmc_state = fmc_bank0_state_get();
        timeout--;
    }while((FMC_BUSY == fmc_state) && (0U != timeout));

    if(FMC_BUSY == fmc_state){
        fmc_state = FMC_TOERR;
    }
    /* return the FMC state */
    return fmc_state;
}

/*!
    \brief      check whether flash bank1 is ready or not
    \param[in]  timeout: timeout count
    \param[out] none
    \retval     fmc_state
*/
fmc_state_enum fmc_bank1_ready_wait(uint32_t timeout)
{
    fmc_state_enum fmc_state = FMC_BUSY;

    /* wait for FMC ready */
    do{
        /* get FMC state */
        fmc_state = fmc_bank1_state_get();
        timeout--;
    }while((FMC_BUSY == fmc_state) && (0U != timeout));
  
    if(FMC_BUSY == fmc_state){
        fmc_state = FMC_TOERR;
    }
    /* return the FMC state */
    return fmc_state;
}

/*!
    \brief      forbid ram/system boot, merely suppport flash boot
    \param[in]  none
    \param[out] none
    \retval     fmc_state: state of FMC
      \arg        FMC_READY: the operation has been completed
      \arg        FMC_BUSY: the operation is in progress
      \arg        FMC_PGERR: program error
      \arg        FMC_PGAERR: program alignment error
      \arg        FMC_WPERR: erase/program protection error
      \arg        FMC_TOERR: timeout error
      \arg        FMC_ILLEGAL_OPERATION: user illegal operation
*/
fmc_state_enum boot_forbid(void)
{
    fmc_state_enum fmc_state;
    uint8_t unlock_flag = 0U;
    
    /* unlock CTL0 register if necessary */
    if((RESET != (FMC_CTL0 & FMC_CTL0_LK))){
        /* write the FMC key */
        FMC_KEY0 = UNLOCK_KEY0;
        FMC_KEY0 = UNLOCK_KEY1;
        unlock_flag = 1U;
    }

    fmc_state = fmc_bank0_ready_wait(FMC_TIMEOUT_COUNT);

    if(FMC_READY == fmc_state){
        /* write efuse BOOT value */
        FMC_EFBOOT = (EFUSE_VALUE<<16U);
        FMC_EFBOOT |= FMC_EFBOOT_START;
    }

    fmc_state = fmc_bank0_ready_wait(FMC_TIMEOUT_COUNT);

    /* recover CTL0 LK bit previous state */
    if(unlock_flag == 1U){
        FMC_CTL0 |= FMC_CTL0_LK;
    }
    /* return the FMC state */
    return fmc_state;

}

/*!
    \brief      disable SWD interface
    \param[in]  none
    \param[out] none
    \retval     fmc_state: state of FMC
      \arg        FMC_READY: the operation has been completed
      \arg        FMC_BUSY: the operation is in progress
      \arg        FMC_PGERR: program error
      \arg        FMC_PGAERR: program alignment error
      \arg        FMC_WPERR: erase/program protection error
      \arg        FMC_TOERR: timeout error
      \arg        FMC_ILLEGAL_OPERATION: user illegal operation 
*/
fmc_state_enum swd_disable(void)
{
    fmc_state_enum fmc_state;
    uint8_t unlock_flag = 0U;

    /* unlock CTL0 register if necessary */
    if((RESET != (FMC_CTL0 & FMC_CTL0_LK))){
        /* write the FMC key */
        FMC_KEY0 = UNLOCK_KEY0;
        FMC_KEY0 = UNLOCK_KEY1;
        unlock_flag = 1U;
    }

    fmc_state = fmc_bank0_ready_wait(FMC_TIMEOUT_COUNT);

    if(FMC_READY == fmc_state){
        /* write efuse SWD value */
        FMC_EFSWD = (EFUSE_VALUE<<16U);
        FMC_EFSWD |= FMC_EFSWD_START;
    }

    fmc_state = fmc_bank0_ready_wait(FMC_TIMEOUT_COUNT);
    /* recover CTL0 LK bit previous state */
    if(unlock_flag == 1U){
        FMC_CTL0 |= FMC_CTL0_LK;
    }
    /* return the FMC state */
    return fmc_state;
}
